# Data Manipulation with Pandas

In [1]:
import pandas as pd

df = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie', 'Bastian', 'Ella', 'Jaco'],
    'age': [7, 83, 34, 12, 79, 35],
    'gender': ['F', 'M', 'M', 'M', 'F', 'M'],
    'city': ['Oxfordshire', 'Marshall', 'Kansas City', 'De Forest', 'Newport News', 'Norristown']
})

## Filtering Rows 
You can filter rows based on specific conditions using boolean indexing.

In [4]:
df

      name  age gender          city
0    Alice    7      F   Oxfordshire
1      Bob   83      M      Marshall
2  Charlie   34      M   Kansas City
3  Bastian   12      M     De Forest
4     Ella   79      F  Newport News
5     Jaco   35      M    Norristown

In [6]:
df['age'] > 30

0    False
1     True
2     True
3    False
4     True
5     True
Name: age, dtype: bool

In [5]:
df_filtered = df[df['age'] > 30]
df_filtered

      name  age gender          city
1      Bob   83      M      Marshall
2  Charlie   34      M   Kansas City
4     Ella   79      F  Newport News
5     Jaco   35      M    Norristown

## Dropping Rows and Columns
You can drop rows and columns from a DataFrame using the `drop()` method.

In [7]:
df

      name  age gender          city
0    Alice    7      F   Oxfordshire
1      Bob   83      M      Marshall
2  Charlie   34      M   Kansas City
3  Bastian   12      M     De Forest
4     Ella   79      F  Newport News
5     Jaco   35      M    Norristown

In [8]:
df_dropped = df.drop('city', axis=1)
df_dropped

      name  age gender
0    Alice    7      F
1      Bob   83      M
2  Charlie   34      M
3  Bastian   12      M
4     Ella   79      F
5     Jaco   35      M

To drop rows based on specific conditions, you can use boolean indexing with negation.

In [9]:
df_dropped = df[~(df['age'] <= 30)]
df_dropped

      name  age gender          city
1      Bob   83      M      Marshall
2  Charlie   34      M   Kansas City
4     Ella   79      F  Newport News
5     Jaco   35      M    Norristown

## Renaming Columns
You can rename columns in a DataFrame using the `rename()` method.

In [10]:
df

      name  age gender          city
0    Alice    7      F   Oxfordshire
1      Bob   83      M      Marshall
2  Charlie   34      M   Kansas City
3  Bastian   12      M     De Forest
4     Ella   79      F  Newport News
5     Jaco   35      M    Norristown

In [11]:
df_renamed = df.rename(columns={'age': 'years'})
df_renamed

      name  years gender          city
0    Alice      7      F   Oxfordshire
1      Bob     83      M      Marshall
2  Charlie     34      M   Kansas City
3  Bastian     12      M     De Forest
4     Ella     79      F  Newport News
5     Jaco     35      M    Norristown

## Handling Missing Data
You can handle missing data in a DataFrame using the `fillna()` method.

In [12]:
df

      name  age gender          city
0    Alice    7      F   Oxfordshire
1      Bob   83      M      Marshall
2  Charlie   34      M   Kansas City
3  Bastian   12      M     De Forest
4     Ella   79      F  Newport News
5     Jaco   35      M    Norristown

In [16]:
new_record.to_frame().T

  name gender         city
0  Ash      M  Pallet Town

In [18]:
# create a dataframe with missing values
new_record = pd.Series({"name":"Ash", "gender":"M", "city":"Pallet Town"})
df_filled = pd.concat([df, new_record.to_frame().T], ignore_index=True)
df_filled

      name   age gender          city
0    Alice   7.0      F   Oxfordshire
1      Bob  83.0      M      Marshall
2  Charlie  34.0      M   Kansas City
3  Bastian  12.0      M     De Forest
4     Ella  79.0      F  Newport News
5     Jaco  35.0      M    Norristown
6      Ash   NaN      M   Pallet Town

In [20]:
df_filled.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   age     6 non-null      float64
 2   gender  7 non-null      object
 3   city    7 non-null      object
dtypes: float64(1), object(3)
memory usage: 352.0+ bytes

In [21]:
df_filled['age'].fillna(df_filled['age'].mean(), inplace=True)
df_filled['age'] = df_filled['age'].astype('int')
df_filled

      name  age gender          city
0    Alice    7      F   Oxfordshire
1      Bob   83      M      Marshall
2  Charlie   34      M   Kansas City
3  Bastian   12      M     De Forest
4     Ella   79      F  Newport News
5     Jaco   35      M    Norristown
6      Ash   41      M   Pallet Town

In [22]:
df_filled.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   age     7 non-null      int32
 2   gender  7 non-null      object
 3   city    7 non-null      object
dtypes: int32(1), object(3)
memory usage: 324.0+ bytes

In [23]:
import numpy as np

# create a dataframe with missing values
df['salary'] = [np.nan, 200, 300, np.nan, 500, 600]
new_record = pd.Series({"name":"Misty", "gender":"F", "city":"Cerulean City"})

df = pd.concat([df, new_record.to_frame().T], ignore_index=True)

df

      name   age gender           city  salary
0    Alice   7.0      F    Oxfordshire     NaN
1      Bob  83.0      M       Marshall   200.0
2  Charlie  34.0      M    Kansas City   300.0
3  Bastian  12.0      M      De Forest     NaN
4     Ella  79.0      F   Newport News   500.0
5     Jaco  35.0      M     Norristown   600.0
6    Misty   NaN      F  Cerulean City     NaN

In [25]:
# check for missing values
df.isnull().any()

name      False
age        True
gender    False
city      False
salary     True
dtype: bool

In [26]:
# fill missing values with a specific value
df["salary"].fillna(0, inplace=True)
df

      name   age gender           city  salary
0    Alice   7.0      F    Oxfordshire     0.0
1      Bob  83.0      M       Marshall   200.0
2  Charlie  34.0      M    Kansas City   300.0
3  Bastian  12.0      M      De Forest     0.0
4     Ella  79.0      F   Newport News   500.0
5     Jaco  35.0      M     Norristown   600.0
6    Misty   NaN      F  Cerulean City     0.0

In [27]:
df.isnull().any()

name      False
age        True
gender    False
city      False
salary    False
dtype: bool

In [28]:
# drop rows with missing values
df.dropna(inplace=True, axis=0)
df

      name   age gender          city  salary
0    Alice   7.0      F   Oxfordshire     0.0
1      Bob  83.0      M      Marshall   200.0
2  Charlie  34.0      M   Kansas City   300.0
3  Bastian  12.0      M     De Forest     0.0
4     Ella  79.0      F  Newport News   500.0
5     Jaco  35.0      M    Norristown   600.0

## Removing duplicates

In [29]:
df

      name   age gender          city  salary
0    Alice   7.0      F   Oxfordshire     0.0
1      Bob  83.0      M      Marshall   200.0
2  Charlie  34.0      M   Kansas City   300.0
3  Bastian  12.0      M     De Forest     0.0
4     Ella  79.0      F  Newport News   500.0
5     Jaco  35.0      M    Norristown   600.0

In [30]:
# create a dataframe with duplicate rows
df = pd.concat([df, df.iloc[4].to_frame().T], ignore_index=True)
df

      name   age gender          city salary
0    Alice   7.0      F   Oxfordshire    0.0
1      Bob  83.0      M      Marshall  200.0
2  Charlie  34.0      M   Kansas City  300.0
3  Bastian  12.0      M     De Forest    0.0
4     Ella  79.0      F  Newport News  500.0
5     Jaco  35.0      M    Norristown  600.0
6     Ella  79.0      F  Newport News  500.0

In [37]:
# check for duplicate rows
df.duplicated(keep='first')

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [38]:
# drop duplicate rows
df.drop_duplicates(inplace=True)

df

      name   age gender          city salary
0    Alice   7.0      F   Oxfordshire    0.0
1      Bob  83.0      M      Marshall  200.0
2  Charlie  34.0      M   Kansas City  300.0
3  Bastian  12.0      M     De Forest    0.0
4     Ella  79.0      F  Newport News  500.0
5     Jaco  35.0      M    Norristown  600.0

## Converting data types

In [40]:
# check data types
df.dtypes

name       object
age         int32
gender     object
city       object
salary    float64
dtype: object

In [43]:
# convert data types
df['age'] = df['age'].astype(int)
df['salary'] = pd.to_numeric(df['salary'])

# check data types again
print(df.dtypes)

name       object
age         int32
gender     object
city       object
salary    float64
dtype: object

In [45]:
df["gender"].unique()

array(['F', 'M'], dtype=object)

## Grouping data
In Python, `groupby` is a method in the Pandas library that is used to group data in a Pandas DataFrame based on one or more columns. It is similar to the SQL GROUP BY statement.

The `groupby` method is used to group data by one or more columns, creating a DataFrameGroupBy object. The object can be used to perform aggregation operations, such as sum, mean, min, and max, on the grouped data.

In [48]:
df.groupby('gender').sum()['salary']

C:\Users\2000076134\AppData\Local\Temp\ipykernel_872\4238236022.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('gender').sum()['salary']

gender
F     500.0
M    1100.0
Name: salary, dtype: float64

In [49]:
df_grouped = df.groupby('gender').mean()['age']
df_grouped

C:\Users\2000076134\AppData\Local\Temp\ipykernel_872\2929854614.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df_grouped = df.groupby('gender').mean()['age']

gender
F    43.0
M    41.0
Name: age, dtype: float64

In [50]:
# create a sample DataFrame
df = pd.DataFrame({
    'Category': ['A', 'B', 'C', 'A', 'B', 'C'],
    'Value': [1, 2, 3, 4, 5, 6]
})

# group the DataFrame by the 'Category' column
grouped_df = df.groupby('Category')

# calculate the mean value for each group
mean_values = grouped_df.mean()

# display the mean values for each group
mean_values

          Value
Category
A           2.5
B           3.5
C           4.5

In this example, we created a DataFrame with two columns, 'Category' and 'Value', and then grouped the data by the 'Category' column using the `groupby` method. We then calculated the mean value for each group using the `mean` method, which returns a new DataFrame with the mean values for each group.

## Merging and Joining data
Merging and joining are ways to combine different data frames based on common columns or indices. The key difference between merging and joining is the way the two data frames are combined.

Merging combines two data frames based on the values of specified columns. If the two data frames share a common column, merging can be performed based on that column. Otherwise, merging can be done based on multiple columns.

Joining, on the other hand, combines two data frames based on their indices.  

There are four types of joins in Pandas:

* **Inner join**: returns only the rows with matching indices in both data frames.
* **Left join**: returns all the rows from the left data frame and the matching rows from the right data frame.
* **Right join**: returns all the rows from the right data frame and the matching rows from the left data frame.
* **Outer join**: returns all the rows from both data frames.

Pandas functions for merging and joining data frames, are `merge()`, `join()`, and `concat()`. These functions have different parameters for specifying the type of merge or join to perform, the columns or indices to merge on or join on, and the method of handling missing values.

In [51]:
# create first dataframe
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'],
                    'value': [1, 2, 3, 4]}, 
                   index=[0, 1, 2, 3])

# create second dataframe
df2 = pd.DataFrame({'key': ['C', 'D', 'E', 'F'],
                    'value': [5, 6, 7, 8]}, 
                   index=[4, 5, 6, 7])

In [55]:
df1

  key  value
0   A      1
1   B      2
2   C      3
3   D      4

In [56]:
df2

  key  value
4   C      5
5   D      6
6   E      7
7   F      8

In [61]:
# perform inner join on 'key' column
inner_join_columns = pd.merge(df1, df2, on='key', how='inner')

inner_join_columns

  key  value_x  value_y
0   C        3        5
1   D        4        6

In [58]:
# perform inner join on rows
inner_join_rows = df1.join(df2, lsuffix='_left', rsuffix='_right', how='inner')

print(inner_join_rows)

Empty DataFrame
Columns: [key_left, value_left, key_right, value_right]
Index: []

In [62]:
# perform left join on 'key' column
left_join_columns = pd.merge(df1, df2, on='key', how='left')

left_join_columns

  key  value_x  value_y
0   A        1      NaN
1   B        2      NaN
2   C        3      5.0
3   D        4      6.0

In [63]:
# perform left join on rows
left_join_rows = df1.join(df2, lsuffix='_left', rsuffix='_right', how='left')

left_join_rows

  key_left  value_left key_right  value_right
0        A           1       NaN          NaN
1        B           2       NaN          NaN
2        C           3       NaN          NaN
3        D           4       NaN          NaN

In [66]:
# perform right join on 'key' column
right_join_columns = pd.merge(df1, df2, on='key', how='right')

right_join_columns

  key  value_x  value_y
0   C      3.0        5
1   D      4.0        6
2   E      NaN        7
3   F      NaN        8

In [67]:
# perform right join on rows
right_join_rows = df1.join(df2, lsuffix='_left', rsuffix='_right', how='right')

right_join_rows

  key_left  value_left key_right  value_right
4      NaN         NaN         C            5
5      NaN         NaN         D            6
6      NaN         NaN         E            7
7      NaN         NaN         F            8

In [70]:
# perform outer join on 'key' column
outer_join_columns = pd.merge(df1, df2, on='key', how='outer')

outer_join_columns

  key  value_x  value_y
0   A      1.0      NaN
1   B      2.0      NaN
2   C      3.0      5.0
3   D      4.0      6.0
4   E      NaN      7.0
5   F      NaN      8.0

In [71]:
# perform outer join on rows
outer_join_rows = df1.join(df2, lsuffix='_left', rsuffix='_right', how='outer')

outer_join_rows

  key_left  value_left key_right  value_right
0        A         1.0       NaN          NaN
1        B         2.0       NaN          NaN
2        C         3.0       NaN          NaN
3        D         4.0       NaN          NaN
4      NaN         NaN         C          5.0
5      NaN         NaN         D          6.0
6      NaN         NaN         E          7.0
7      NaN         NaN         F          8.0

# Pivoting and Reshaping data

Pivoting and reshaping data refer to the process of transforming data from its original form to a more structured and organized form that is easier to analyze.

**Pivoting** refers to the process of reorganizing a dataframe so that the values of one column become the column headers, while the values in another column become the row indices. This can be useful for creating summary tables and reports.

**Reshaping**, on the other hand, refers to the process of changing the structure of a dataframe by rearranging its rows and columns. This can be useful for aggregating data and performing more complex data analysis.

Pandas provides several functions for pivoting and reshaping data, including `pivot()`, `melt()`, `stack()`, `unstack()`, `pivot_table()`, and `transpose()`. These functions allow you to manipulate dataframes in various ways to suit your analysis needs.

**Note:**  
**"wide"** format and a **"long"** format of data. In a **wide format**, a DataFrame has multiple columns for different variables, while in a **long format**, the same variables are stacked in a single column and identified by a second column of labels.

### Pivot
For example, you can use the `pivot()` function to transform a long-form dataframe into a wide-form dataframe by specifying the columns to use as row and column labels and the values to use for populating the cells:

In [72]:
# create a long-form dataframe
df_long = pd.DataFrame({'Year': [2010, 2010, 2011, 2011],
                        'Quarter': ['Q1', 'Q2', 'Q1', 'Q2'],
                        'Sales': [100, 200, 150, 250]})

# pivot the dataframe to wide format
df_wide_pivot = df_long.pivot(index='Year', columns='Quarter', values='Sales')

In [73]:
df_long

   Year Quarter  Sales
0  2010      Q1    100
1  2010      Q2    200
2  2011      Q1    150
3  2011      Q2    250

In [74]:
df_wide_pivot

Quarter   Q1   Q2
Year
2010     100  200
2011     150  250

In this example, the `pivot()` function is used to pivot the `df_long` dataframe into a `df_wide` dataframe with the years as row labels, quarters as column labels, and sales values as cell values.

### Melt
Similarly, you can use the `melt()` function to transform a wide-form dataframe into a long-form dataframe by specifying the columns to use as id variables and the columns to use as value variables:

In [75]:
df_wide_1 = df_wide_pivot.reset_index()

df_wide_1

Quarter  Year   Q1   Q2
0        2010  100  200
1        2011  150  250

In [76]:
# melt the dataframe to long format
df_long_melt = pd.melt(df_wide_1, id_vars=['Year'], var_name='Quarter', value_name='Sales')

df_long_melt

   Year Quarter  Sales
0  2010      Q1    100
1  2011      Q1    150
2  2010      Q2    200
3  2011      Q2    250

In this example, the `melt()` function is used to melt the `df_wide` dataframe into a `df_long` dataframe with the years and quarters as id variables, and sales as the value variable.

### Stacking and Unstacking
The `stack()` operation pivots a level of the level of column labels into row labels/index, creating a multi-level index. The `unstack()` operation does the opposite, pivoting a level of row labels/index into column labels.

if we have a DataFrame with two columns, A and B, and two index levels, 1 and 2, calling stack() will result in a new DataFrame with three index levels (1, 2, and a new level created from the column labels), and one column that contains the stacked data.

In [77]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]}, 
                  index=pd.MultiIndex.from_tuples([(1, 'a'), (2, 'b'), (3, 'c')], 
                    names=['level_1', 'level_2']))
df

                 A  B
level_1 level_2
1       a        1  4
2       b        2  5
3       c        3  6

In [78]:
stacked = df.stack()
stacked.to_frame()

                   0
level_1 level_2
1       a       A  1
                B  4
2       b       A  2
                B  5
3       c       A  3
                B  6

In [79]:
unstacked = stacked.unstack()
unstacked

                 A  B
level_1 level_2
1       a        1  4
2       b        2  5
3       c        3  6

### Pivot Table  
The `pivot_table()` function is used to summarize and aggregate data in a DataFrame. It takes several arguments, including `values`, which specifies the column to aggregate, `index`, which specifies the column(s) or index level(s) to group by, and `columns`, which specifies the column(s) or index level(s) to pivot. Then, creates a new DataFrame by aggregating data based on one or more columns and/or index levels.

In [80]:
df = pd.DataFrame({'A': [1, 2, 3, 1, 2, 3], 'B': [4, 5, 6, 7, 8, 9], 'C': ['x', 'y', 'z', 'x', 'y', 'z']})
df

   A  B  C
0  1  4  x
1  2  5  y
2  3  6  z
3  1  7  x
4  2  8  y
5  3  9  z

In [81]:
pivot = df.pivot_table(values='B', index='A', columns='C', aggfunc='sum')
pivot

C     x     y     z
A
1  11.0   NaN   NaN
2   NaN  13.0   NaN
3   NaN   NaN  15.0

### Transposing
Transposing a DataFrame means interchanging rows and columns. This operation is useful to change the shape of the DataFrame to better suit a particular analysis or visualization.

In [82]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

df

   A  B
0  1  4
1  2  5
2  3  6

In [83]:
transposed = df.transpose()

transposed

   0  1  2
A  1  2  3
B  4  5  6

In [84]:
df.T

   0  1  2
A  1  2  3
B  4  5  6

> Content created by **Carlos Cruz-Maldonado**.  
> Feel free to ping me at any time.